# 【プログラムを構成する基本的な機能】
# プログラミング言語には、値を一時的に保存したり、計算したり、処理を繰り返したり、
# 条件によっては処理を分岐したりする基本的な機能があり、それらを組み合わせる事で、プログラムを作っている
# 
# 
# 
# 【プログラムを構成する６大要素】
# Chapter３までは、命令を書くと、それが書いた順に上から実行される。
# しかし、それだけでは、ただ手順を記録した「レコーダー」のように、並べられた事を順に実行するしかできない
# ここで利用したいのがプログラムを制御するための基本機能です。
# Pythonに限らず、ほぼすべてのプログラミング言語には、命令を繰り返したり、
# 計算結果などによって処理を分岐したりする機能がある
# 
# 
# 【プログラミングを制御するためにの６つの基本機能】
# 
# ①計算機能
# 「+」「-」「*」「/」を使った四則演算や、「+」を使った文字列の連結
# 
# ②変数(へんすう)
# 計算結果をはじめ、ユーザーが入力した値やファイルからの読み取り、ネットワーク通信で取得したデータなど、
# ありとあらゆるデータを一時的に保存する仕組み。
# 
# ③繰り返し
# 命令を何回か(もしくは何十回か何百回、何千回、もしくは終了するまで永遠に)繰り返し実行する機能
# 命令を１つしか書かなくても、指定した回数だけ繰り返す事ができる
# 
# ④条件分岐
# 計算結果や変数に格納された値が、どのようなものかであるかによって、処理を分岐する仕組み
# 条件分岐は、とても多岐に渡って使われる。
# 例えば、「入力した文字や数字が範囲内にあるかどうかを調べてエラーメッセージを表示する」とか
# 「今日が日曜日のときは、別の処理をする」など
# 
# ⑤関数
# 処理を１つにまとめる事ができる方法
# Lesson3-5　では、「str関数」を使って数値を文字列に変換したが、それ以外にもたくさんの関数がある
# そして関数は、自分で作ることもできる
# 
# ⑥モジュール(外部機能)
# Python本体には基本的な機能しかない。
# 「ウィンドウを表示したい」とか「音を出したい」「ネットワークを通信したい」などの機能は、
# Pythonとは別に追加できる形式で提供されている。この追加機能の事を「モジュール」と呼ぶ
# モジュールを使うには、最初にモジュールを「読み込む」ための操作が必要
# 
# 
# プログラムは、この６つの基本機能を組み合わせて作っていく
# 
# 
