# 【配列・連想配列】
# Pythonに限らずプログラミングを行う上で配列は非常に重要です。ここでは主要な配列の概要を示すとともに、同じような機能の配列であっても言語ごとに呼び方が異なる場合があるため、ここでまとめておきます。
# 
# 1 配列の種類
# 2 他の言語では
# 
# １【配列の種類】
# 主な配列には以下の４つがあります。
# ① タプル（tuple）
# ② リスト（list）
# ③ ディクショナリ・辞書（dict）
# ④ セット・集合（set）
# 
# 
# ①
# 《タプル（tuple）》
# 任意の数の要素を持つことができる配列です。作成したあとは要素の追加や削除を行うことができません。
# 
# ②
# 《リスト（list）》
# 任意の数の要素を持つことができる配列です。作成したあとでも要素の追加や削除を行うことができます。
# 
# ③
# 《ディクショナリ・辞書（dict）》
# 任意の数の要素を持つことができる配列で、keyとvalueのペアを一要素とします。作成した後でも要素の追加や削除を行うことができますが、1つのディクショナリの中で同じkeyを持つことができません。

# ④
# 《セット・集合（set）》
# 任意の数の要素を持つことができる配列です。作成した後でも要素の追加や削除を行うことができますが、1つのセットの中で重複した要素を持つことができません。
# 
# 
# 
# ２【他の言語では】
# 他のプログラミング言語の経験がある方は、リストやディクショナリという呼称よりも配列、連想配列などの方がなじみがあるかもしれません。Pythonにおける配列・連想配列にあたるクラスは次の通りです。
# 配列、リスト → リスト(https://www.python-izm.com/basic/list/)
# 連想配列、マップ、ハッシュ → ディクショナリ(https://www.python-izm.com/basic/dict/)
# 
# 