# 【文字列を連結してみよう】
# 文字列は「+」で連結できますが、文字と数値を連結するときは変換操作が必要
# 《Pythonでは数値と文字列は別扱い》
# 
# print("abc" + "def")
# 
# 《実行結果》
# abcdef
# 
# 「＋」を使えばいくつでも連結できる
# 
# 《COLUMN》
# 「*」で繰り返す
# 文字列では「*」(アスタリスク)と言う計算式も使える
# 
# print("abc"*3)
# 
# 《実行結果》
# abcabcabc
# 
# 
# 文字列と数値は連結できない
# 「文字列」と「数値」は「+」で連結できない
# 
# print("abc" + 123)
# 
# 《実行結果》
# Error
# 
# 
# これは「+」の記号がそれぞれ違う意味で作用するから
# ・文字列の場合は「連結」
# ・数値の場合は「足し算」
# そのためErrorが出てしまう
# 
# 『解決方法は「数値」を「文字列」に変換すればいいだけ』
# 
# print("abc" + "123")
# 
# 《実行結果》
# abc123
# 
# P63から
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
# 
